Tekla Open API Reference for Tekla Structures 2025
CurvedDimensionSetOrthogonalAttributes Constructor
Overload List
Name | Description
CurvedDimensionSetOrthogonal.CurvedDimensionSetOrthogonalAttributes()
 Creates a new curved dimension set orthogonal attributes instance which loads standard attributes.
CurvedDimensionSetOrthogonal.CurvedDimensionSetOrthogonalAttributes(String)
 Creates a new curved dimension set orthogonal attributes instance that loads the specified attributes.
Top
See Also
Reference
CurvedDimensionSetOrthogonal.CurvedDimensionSetOrthogonalAttributes Class
Tekla.Structures.Drawing Namespace